import type { Trainer } from '@/entities/trainer';
import annaMusikhinaImg from '@/shared/assets/mentors/a-musikhina.webp';
import lyusyaCoolImg from '@/shared/assets/mentors/l-cool.webp';
import margaritaGolubevaImg from '@/shared/assets/mentors/m-golubeva.webp';
import mikhailOleinikImg from '@/shared/assets/mentors/m-oleinik.webp';
import nataliaLebedevaImg from '@/shared/assets/mentors/n-lebedeva.webp';
import sergeyKoksharovImg from '@/shared/assets/mentors/s-koksharov.webp';
import vadimAntonauImg from '@/shared/assets/mentors/v-antonau.webp';
import vitaliiRogozinImg from '@/shared/assets/mentors/v-rogozin.webp';
import yuliaKursevichImg from '@/shared/assets/mentors/y-kursevich.webp';

export const javaScriptRu: Trainer[] = [
  {
    name: 'Вадим Антонов',
    role: 'Full Stack Engineer @dev Team Inc.',
    bio: 'Программист с более чем 10-летним опытом работы, изначально в PHP, а теперь full-stack инженер, владеющий TypeScript, Angular, React, Node.js и AWS. После десяти лет работы с PHP он переключил свое внимание на современные full-stack технологии, успешно прошел соответствующие курсы и теперь обучает других.',
    photo: vadimAntonauImg,
  },

  {
    name: 'Анна Мусихина',
    role: '',
    bio: 'Самые глубокие страсти в жизни Анны – создавать крутые вещи и помогать людям. Фронтенд-разработка – это то место, где эти страсти соединяются, поэтому она полностью увлечена этим процессом. Она здесь, чтобы сделать путь каждого в мир IT немного мягче, поэтому присоединяйтесь к ее путешествию!',
    photo: annaMusikhinaImg,
  },

  {
    name: 'Виталий Рогозин',
    role: '',
    bio: 'Пришел в конце 2021 года в RSS просто «посмотреть», что это такое, и как-то незаметно для себя прошел сначала подготовительный этап, а потом и основной курс. Учился параллельно работе разработчиком web-приложений (Vue). Во время обучения понял одну интересную вещь: когда объясняешь другим какой-то материал, то и сам начинаешь в нем лучше разбираться. И сейчас продолжаю, в меру своих возможностей, помогать студентам начинать этот сложный путь.',
    photo: vitaliiRogozinImg,
  },

  {
    name: 'Юлия Курсевич',
    role: '',
    bio: 'Закончила курс в 2024. Я верю, что помогая другим, мы растем и развиваемся сами. Мне знакомы все трудности, с которыми сталкиваются студенты, и я здесь, чтобы поддержать и облегчить ваш путь. Будем вместе делать наш курс удивительным и волшебным местом для взращивания новых талантов в мире фронтенда!',
    photo: yuliaKursevichImg,
  },

  {
    name: 'Маргарита Голубева',
    role: '',
    bio: 'Будучи преподавателем английского для IT-специалистов, Маргарита решила разобраться, почему этот мир привлекает столько людей. Начав свой путь из чистого любопытства, она вскоре поняла, что для неё программирование – это не просто увлечение, а настоящее призвание. Пройдя курс по фронтенд-разработке, она полностью погрузилась в этот мир и теперь не представляет ни одного дня без кода. Маргарита активно продолжает развиваться в IT и стремится помочь другим лучше понять и освоить эту увлекательную сферу.',
    photo: margaritaGolubevaImg,
  },

  {
    name: 'Михаил Олейник',
    role: 'Full Stack developer',
    bio: 'Михаил с юности увлекался программированием, однако на протяжении долгого времени проработал в сфере строительства. В какой-то момент он решил радикально изменить свою жизнь, успешно завершив обучение в БГУиР. В настоящее время Михаил работает в качестве фуллстек разработчика в компании "Геоинформационные системы". В 2022 году он успешно завершил курс в RS School, а сейчас активно помогает в обучении студентов RS школы, передавая свой опыт и знания.',
    photo: mikhailOleinikImg,
  },

  {
    name: 'Сергей Кокшаров',
    role: '',
    bio: 'Сергей родился и вырос в маленьком городе недалеко от Петербурга. Увлекался шахматами в детстве, а программирование и алгоритмические задачи полюбил в старших классах. Ему всегда было интересно, как что-то работает под капотом. В RS School записался в 2022-м из любопытства, оказался успешным студентом и прошел почти все доступные курсы. В начале 2024-го начал коммерческую карьеру в качестве фронтенд-разработчика и теперь помогает другим студентам в осуществлении их мечты. Кроме программирования обожает ОС семейства *nix, настольные игры, и своего рыжего кота.',
    photo: sergeyKoksharovImg,
  },
  {
    name: 'Lyusya Cool',
    role: '',
    bio: 'Люся, также известная как Cherry в сообществе Discord RS School, теперь активно помогает в роли модератора, делая сервер еще более дружелюбным и ярким. Изначально ее привело сюда стремление создавать потрясающие визуальные вещи. Люся закончила два университета в Санкт-Петербурге (один по специальности железнодорожный инженер и другой по связям с общественностью). Однажды, создавая фавиконку для работы, она задумалась: «Хм, а как они делают так, чтобы эта крошечная красивая картинка появлялась на вкладке Google?» Это любопытство, вместе с ее художественным образованием, привело ее к тому, что она нашла наибольший интерес в Angular, особенно после того, как увидела его новый градиентный логотип и обновленный сайт.',
    photo: lyusyaCoolImg,
  },
  {
    name: 'Наталья Лебедева',
    role: 'EPAM, Junior Software Engineer',
    bio: 'Наталья прошла обучение в RS School, прониклась духом школы и стала ее ментором и контрибьютором. Пройдя через лабораторию EPAM, воплотила свою мечту и стала разработчиком. Обожает проводить время в компании единомышленников и организует встречи RS School community в Алматы. Хочет помочь другим на их нелегком пути.',
    photo: nataliaLebedevaImg,
  },
];
