import { MentorFeedback } from '@/entities/mentor';
import mentorSloth1 from '@/shared/assets/svg/mentor-sloths/1.svg';
import mentorSloth2 from '@/shared/assets/svg/mentor-sloths/2.svg';

export const mentorsFeedbackData: MentorFeedback[] = [
  {
    name: 'Матвеев Михаил',
    course: 'FE Javascript',
    review:
      'По моему мнению это один из лучшех курсов школы. Огромное количество интересных заданий, которые постоянно обновляются. Однако для лучшего усвоения материала ментор/наставник тут необходим для большинства студентов. Я сам заканчивал этот курс и для меня структура курса и сам процесс менторинга не был чем то новым, я знал на что иду. На все задачки которые ты должен проверять как ментор дается более чем достаточно времени, а все остальное довольно индивидуально. У меня были студенты которые очень боялись задавать вопросы, боялись сдавать таски, были слабые студенты, были сильные студенты, но все они выросли и стали лучше.',
    photo: mentorSloth1,
  },
  {
    name: 'Оксана Федотова',
    course: 'JavaScript/Front-end 2023Q1',
    review: `Должна отметить, что мне в целом очень понравились курсы RS School. Для меня удивительно и здорово, что есть такие курсы, которые позволяют изучать различные направления разработки бесплатно, при этом на высоком уровне. 
    
    Ментором я стала почти случайно. Однажды мне пришло письмо на электронную почту с информацией о том, что идет новый курс и не хватает менторов. Я решила попробовать. Мне назначили трёх студентов, с которыми мы провели вводной созвон, познакомились и обсудили предстоящую работу.`,
    photo: mentorSloth2,
  },
  {
    name: 'Матвеев Михаил',
    course: 'FE Javascript',
    review:
      'По моему мнению это один из лучшех курсов школы. Огромное количество интересных заданий, которые постоянно обновляются. Однако для лучшего усвоения материала ментор/наставник тут необходим для большинства студентов. Я сам заканчивал этот курс и для меня структура курса и сам процесс менторинга не был чем то новым, я знал на что иду. На все задачки которые ты должен проверять как ментор дается более чем достаточно времени, а все остальное довольно индивидуально. У меня были студенты которые очень боялись задавать вопросы, боялись сдавать таски, были слабые студенты, были сильные студенты, но все они выросли и стали лучше.',
    photo: mentorSloth1,
  },
  {
    name: 'Оксана Федотова',
    course: 'JavaScript/Front-end 2023Q1',
    review: `Должна отметить, что мне в целом очень понравились курсы RS School. Для меня удивительно и здорово, что есть такие курсы, которые позволяют изучать различные направления разработки бесплатно, при этом на высоком уровне. 
    
    Ментором я стала почти случайно. Однажды мне пришло письмо на электронную почту с информацией о том, что идет новый курс и не хватает менторов. Я решила попробовать. Мне назначили трёх студентов, с которыми мы провели вводной созвон, познакомились и обсудили предстоящую работу.`,
    photo: mentorSloth2,
  },
];
